[
  {
    "id": 1,
    "name": "A Speech",
    "author": "Gazi Mustafa Kemal",
    "price": 18.81,
    "oldPrice": 19,
    "description": "I Landed At Samsoon On The 19th Of May, 1919…” Thus Begins A Speech, The Renowned Address On The Turkish War Of Independence. The Speech Was Given By The Founder Of The Turkish Republic, Mustafa Kemal Atatürk In The Grand National Assembly Of Turkey Between The 15th And The 20th Of October, 1927 And First Published In Turkish In 1927. This English Edition Is A Facsimile Of The English Translation Published In Leipzig, Germany In 1929, By K.F. Koehler.",
    "starRate": 5,
    "reviewCount": 197,
    "stock": 1881,
    "imgSource": "./assets/book images/theSpeech.png",
    "type": "HISTORY"
  },
  {
    "id": 2,
    "name": "The Little Prince",
    "author": "Antoine de Saint-Exupéry",
    "price": 8,
    "oldPrice": 10,
    "description": "A pilot crashes in the Sahara Desert and encounters a strange young boy who calls himself the Little Prince. The Little Prince has traveled there from his home on a lonely, distant asteroid with a single rose. The story that follows is a beautiful and at times heartbreaking meditation on human nature. The Little Prince is one of the best-selling and most translated books of all time, universally cherished by children and adults alike, and Richard Howard's translation of the beloved classic beautifully reflects Saint-Exupéry's unique and gifted style, bringing the English text as close as possible to the French in language, style, and spirit. In this special edition, the artwork has been restored to match in detail and in color Saint-Exupéry's original artwork. This definitive English-language edition of The Little Prince will capture the hearts of readers of all ages.",
    "starRate": 4.7,
    "reviewCount": 330,
    "stock": 59,
    "imgSource": "./assets/book images/theLittlePrince.png",
    "type": "JUVENILE"
  },
  {
    "id": 3,
    "name": "Dune",
    "author": "Frank Herbert ",
    "price": 14.95,
    "oldPrice": null,
    "description": "Set on the desert planet Arrakis, Dune is the story of Paul Atreides—who would become known as Muad'Dib—and of a great family's ambition to bring to fruition mankind's most ancient and unattainable dream. A stunning blend of adventure and mysticism, environmentalism and politics, Dune won the first Nebula Award, shared the Hugo Award, and formed the basis of what is undoubtedly the grandest epic in science fiction.",
    "starRate": 4.2,
    "reviewCount": 96,
    "stock": 12,
    "imgSource": "./assets/book images/dune.png",
    "type": "NOVEL"
  },
  {
    "id": 4,
    "name": "Medieval Europe",
    "author": "Chris Wickham",
    "price": 21.82,
    "oldPrice": null,
    "description": "A spirited and thought-provoking history of the vast changes that transformed Europe during the 1,000-year span of the Middle Ages. The millennium between the breakup of the western Roman Empire and the Reformation was a long and hugely transformative period—one not easily chronicled within the scope of a few hundred pages. Yet distinguished historian Chris Wickham has taken up the challenge in this landmark book, and he succeeds in producing the most riveting account of medieval Europe in a generation.",
    "starRate": 4.1,
    "reviewCount": 52,
    "stock": 3,
    "imgSource": "./assets/book images/medievalEurope.png",
    "type": "HISTORY"
  },
  {
    "id": 5,
    "name": "1984",
    "author": "George Orwell",
    "price": 19.84,
    "oldPrice": null,
    "description": "The Party told you to reject the evidence of your eyes and ears. It was their final, most essential command.",
    "starRate": 4.6,
    "reviewCount": 183,
    "stock": 152,
    "imgSource": "./assets/book images/1984.png",
    "type": "NOVEL"
  },
  {
    "id": 6,
    "name": "Animal Farm",
    "author": "George Orwell",
    "price": 12.99,
    "oldPrice": null,
    "description": "All animals are equal, but some animals are more equal than others.",
    "starRate": 3.9,
    "reviewCount": 44,
    "stock": 9,
    "imgSource": "./assets/book images/animalFarm.png",
    "type": "NOVEL"
  },
  {
    "id": 7,
    "name": "Ikigai",
    "author": "Héctor García and Francesc Miralles",
    "price": 13.29,
    "oldPrice": 13.99,
    "description": "Discovering your ikigai, or passion, can be one of the greatest journeys you will embark on.",
    "starRate": 4.3,
    "reviewCount": 83,
    "stock": 22,
    "imgSource": "./assets/book images/ikigai.png",
    "type": "SELFIMPROVEMENT"
  },
  {
    "id": 8,
    "name": "The Book Thief",
    "author": "Markus Zusak",
    "price": 7.83,
    "oldPrice": null,
    "description": "Liesel Meminger is a foster girl living outside of Munich, who scratches out a meager existence for herself by stealing when she encounters something she can’t resist–books. With the help of her accordion-playing foster father, she learns to read and shares her stolen books with her neighbors during bombing raids as well as with the Jewish man hidden in her basement.",
    "starRate": 4.3,
    "reviewCount": 59,
    "stock": 89,
    "imgSource": "./assets/book images/theBookThief.png",
    "type": "JUVENILE"
  },
  {
    "id": 9,
    "name": "A Brief History of Time",
    "author": "Stephen Hawking",
    "price": 9.99,
    "oldPrice": null,
    "description": "A Brief History of Time, published in 1988, was a landmark volume in science writing and in world-wide acclaim and popularity, with more than 9 million copies in print globally. The original edition was on the cutting edge of what was then known about the origins and nature of the universe. But the ensuing years have seen extraordinary advances in the technology of observing both the micro- and the macrocosmic world--observations that have confirmed many of Hawking's theoretical predictions in the first edition of his book.",
    "starRate": 4.7,
    "reviewCount": 78,
    "stock": 61,
    "imgSource": "./assets/book images/aBriefHistoryOfTime.png",
    "type": "SCIENCE"
  },
  {
    "id": 10,
    "name": "Fahrenheit 451",
    "author": "Ray Bradbury",
    "price": 4.51,
    "oldPrice": 12.89,
    "description": "Guy Montag is a fireman. His job is to destroy the most illegal of commodities, the printed book, along with the houses in which they are hidden. Montag never questions the destruction and ruin his actions produce, returning each day to his bland life and wife, Mildred, who spends all day with her television “family.” But when he meets an eccentric young neighbor, Clarisse, who introduces him to a past where people didn’t live in fear and to a present where one sees the world through the ideas in books instead of the mindless chatter of television, Montag begins to question everything he has ever known.",
    "starRate": 4.5,
    "reviewCount": 250,
    "stock": 14,
    "imgSource": "./assets/book images/fahrenheit451.png",
    "type": "NOVEL"
  },
  {
    "id": 11,
    "name": "Nuclear War: A Scenario",
    "author": "Annie Jacobsen",
    "price": 27,
    "oldPrice": 31.74,
    "description": "Gripping . . . essential if you want to understand the complex and disturbing details that go into a civilization-destroying decision to drop the Bomb on an enemy. . . . Jacobsen has done her homework. She has spent more than a decade interviewing dozens of experts while mastering the voluminous literature on the subject, some of it declassified only in recent years.",
    "starRate": 3.4,
    "reviewCount": 78,
    "stock": 44,
    "imgSource": "./assets/book images/nuclearWar.png",
    "type": "HISTORY"
  },
  {
    "id": 12,
    "name": "From Blood and Ash: A Blood and Ash Novel",
    "author": "Jennifer L. Armentrout",
    "price": 24.6,
    "oldPrice": null,
    "description": "Chosen from birth to usher in a new era, Poppy's life has never been her own. The life of the Maiden is solitary. Never to be touched. Never to be looked upon. Never to be spoken to. Never to experience pleasure. Waiting for the day of her Ascension, she would rather be with the guards, fighting back the evil that took her family, than preparing to be found worthy by the gods. But the choice has never been hers.",
    "starRate": 4.4,
    "reviewCount": 199,
    "stock": 26,
    "imgSource": "./assets/book images/fromBloodAndAsh.png",
    "type": "NOVEL"
  }
]